Core/src/Documents/AzRyПередачаИмуществаСотруднику/AzRyПередачаИмуществаСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AzRyПередачаИмуществаСотруднику</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.AzRyПередачаИмуществаСотруднику</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.AzRyВидыОперацийПередачаИмуществаСотруднику</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>IT</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>HumanResources</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаведующийПоСкладу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЗакупкиСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/AzRyШтрихкодыВнеоборотныеАктивы/AzRyШтрихкодыВнеоборотныеАктивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AzRyШтрихкодыВнеоборотныеАктивы</name>
  <resources>
    <name>ВнеоборотныеАктивы</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Documents/AzRyПередачаИмуществаСотруднику/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка, ВидОперацииПередача) Экспорт
	
	Макет = Документы.AzRyПередачаИмуществаСотруднику.ПолучитьМакет("Макет" + ?(ВидОперацииПередача, "1", "2"));
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	AzRyШтрихкодыВнеоборотныеАктивы.Штрихкод КАК Штрихкод,
	|	AzRyШтрихкодыВнеоборотныеАктивы.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|ПОМЕСТИТЬ Штр
	|ИЗ
	|	РегистрСведений.AzRyШтрихкодыВнеоборотныеАктивы КАК AzRyШтрихкодыВнеоборотныеАктивы
	|ГДЕ
	|	AzRyШтрихкодыВнеоборотныеАктивы.ВнеоборотныеАктивы В
	|			(ВЫБРАТЬ
	|				AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.ВнеоборотныйАктив
	|			ИЗ
	|				Документ.AzRyПередачаИмуществаСотруднику.ВнеоборотныеАктивы КАК AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы
	|			ГДЕ
	|				AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AzRyПередачаИмуществаСотруднику.Номер КАК Номер,
	|	AzRyПередачаИмуществаСотруднику.Дата КАК Дата,
	|	AzRyПередачаИмуществаСотруднику.Автор КАК Автор,
	|	AzRyПередачаИмуществаСотруднику.Комментарий КАК Комментарий,
	|	AzRyПередачаИмуществаСотруднику.HumanResources КАК HumanResources,
	|	AzRyПередачаИмуществаСотруднику.IT КАК IT,
	|	AzRyПередачаИмуществаСотруднику.ЗаведующийПоСкладу КАК ЗаведующийПоСкладу,
	|	AzRyПередачаИмуществаСотруднику.Склад КАК Склад,
	|	AzRyПередачаИмуществаСотруднику.Организация.НаименованиеАнглийское КАК Организация,
	|	AzRyПередачаИмуществаСотруднику.Сотрудник.Наименование КАК Сотрудник,
	|	AzRyПередачаИмуществаСотруднику.Сотрудник.Физлицо.ДатаРождения КАК ДатаРождения,
	|	AzRyПередачаИмуществаСотруднику.Сотрудник.Физлицо.ИНН КАК ИНН,
	|	AzRyПередачаИмуществаСотруднику.Организация.ИНН КАК ОрганизацияИНН
	|ИЗ
	|	Документ.AzRyПередачаИмуществаСотруднику КАК AzRyПередачаИмуществаСотруднику
	|ГДЕ
	|	AzRyПередачаИмуществаСотруднику.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.Ссылка КАК Ссылка,
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.НомерСтроки КАК НомерСтроки,
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.СтоимостьЗакупкиСНДС КАК СтоимостьЗакупкиСНДС,
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.Штрихкод КАК Штрихкод
	|ИЗ
	|	Документ.AzRyПередачаИмуществаСотруднику.ВнеоборотныеАктивы КАК AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Штр КАК Штр
	|		ПО AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.ВнеоборотныйАктив = Штр.ВнеоборотныеАктивы
	|ГДЕ
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.Ссылка = &Ссылка";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка   = РезультатЗапроса[1].Выбрать();
	ВыборкаТипПродажи = РезультатЗапроса[2].Выбрать();
	
	//Выборка = РезультатЗапросаШапка.Выбрать();

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТипПродажи = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	
		ОбластьШапка.Параметры.Организация  = Выборка.Организация;
		ОбластьШапка.Параметры.Сотрудник    = Выборка.Сотрудник;
		ОбластьШапка.Параметры.ДатаРождения = Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ИНН          = Выборка.ИНН; 
		ОбластьШапка.Параметры.Год          = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy") + " წელი";      
		ТабДок.Вывести(ОбластьШапка);
		
		//ВыборкаТипПродажи = Выборка.ВнеоборотныеАктивы.Выбрать();
		Сумма = 0;
		Пока ВыборкаТипПродажи.Следующий() Цикл
			ОбластьТипПродажи.Параметры.Заполнить(ВыборкаТипПродажи);
			ТабДок.Вывести(ОбластьТипПродажи, Выборка.Уровень());
			Сумма = Сумма + ВыборкаТипПродажи.СтоимостьЗакупкиСНДС;
		КонецЦикла;
	
		ОбластьПодвал.Параметры.Заполнить(Выборка);
		ОбластьПодвал.Параметры.Сумма = Сумма;
		ТабДок.Вывести(ОбластьПодвал, Выборка.Уровень());
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
